## =======================================================
## 파일 입출력 - with ~ as 구문
##             파일 close() 자동 처리
## =======================================================
## ---------------------------------
## 전역 변수
## ---------------------------------
FILE_PATH = 'new_data.txt'

## ---------------------------------
## 파일 읽기
## ---------------------------------
with open(FILE_PATH, mode='r', encoding='utf-8') as F:
    all_data = F.read()

print(f'all_data : {all_data}')

## ---------------------------------
## 파일 쓰기
## ---------------------------------
with open(FILE_PATH, mode='w', encoding='utf-8') as F:
    F.write("Good Luck")
