# =========================================================
# 기본 자료형 - Bool 자료형
# 
# - 맞음/참/Yes 의미 -> 기계어 1
# - 틀림/거짓/No 의미 -> 기계어 0
# *** 정수 1과 논리 1, 정수 0과 논리 0 식별 모호
# *** 모호성을 해결하기 위한 자료형
# 
# => 저장 가능한 데이터 : True, False 2개만 존재
# =========================================================
# ---------------------------------------------------------
# bool 데이터 생성
# ---------------------------------------------------------
data1 = False
data2 = True
data3 = bool(False)

print(f"data1 : {data1}")
print(f"data2 : {data2}")
print(f"data3 : {data3}")

# ---------------------------------------------------------
# bool 자료형과 다른 자료형 사이의 변환
# 형식 : bool(데이터) -> 해당 데이터를 bool 타입으로 변환
# ---------------------------------------------------------
# [1] int/float <-> bool 형변환 : 0만 False, 나머지는 True
# ---------------------------------------------------------
data1, data2 = -9, 0

print(f"{data1:>2} >>> bool({data1:^3}) : {bool(data1)}")
print(f"{data2:>2} >>> bool({data2:^3}) : {bool(data2)}")

print(f"True  >>> int(True)  : {int(True)}")
print(f"False >>> int(False) : {int(False)}")

# ---------------------------------------------------------
# [2] str <-> bool 형변환 : 원소 개수가 0개 False, 1개 이상이면 True
# ---------------------------------------------------------
data1, data2 = ' ', ''

print(f"'{data1}' >>> bool('{data1}') : {bool(data1)}")
print(f"'{data2}' >>> bool('{data2}') : {bool(data2)}")

print(f"True  >>> str(True)  : {str(True)}")
print(f"False >>> str(False) : {str(False)}")
