# =========================================================
# 컨테이너 자료형 - [5] Set 자료형
# 
# - 중복 데이터는 저장되지 않음
# - 원소/요소 식별용 인덱스 없음
# - 표현 방식 : {원소1, 원소2, 원소3, ... , 원소n}
# - 빈 집합 : {} => 빈 dict, set() => 빈 set
# =========================================================
# ---------------------------------------------------------
# 예시 set 생성
# ---------------------------------------------------------
data = {1, 1, 2, 1, 3, 2}
print(f"data : {len(data)}개, {type(data)}, {data}")

data1 = {}      # empty dict
data2 = set()   # empty set

print(f"data : {len(data1)}개, {type(data1)}, {data1}")
print(f"data : {len(data2)}개, {type(data2)}, {data2}")