# =================================================
# 			Pandas : 필터링과 자료형 변환
# =================================================

# [사용 파일]
# - students_records.json

# [학습 범위]
# - 불린 인덱싱
# - isin()
# - query()
# - astype()
# - pd.to_numeric()
# - pd.to_datetime()

# [ 문제 유형 ]
# - 문제 1~10은 필터링 복습 문제입니다.
# - 문제 11~20은 자료형 변환 복습 문제입니다.
# - 문제 20은 자료형 변환과 필터링을 함께 복습하는 종합 문제입니다.

import pandas as pd

df = pd.read_json(r'./DATA/students_records.json', orient='records')

num = 0
def split():
    global num
    num += 1
    print(f"{f' 문제 {num:0>2}번 ':-^90}")

print(df)

# #########################################################
# #				필터링 문제 10개                                              #
# #########################################################
# =================================================
# 문제 1. score가 90점 이상인 학생만 출력하세요.
# =================================================
split()
print(df[df['score']>=90])

# =================================================
# 문제 2. age가 21세 이상인 학생만 출력하세요.
# =================================================
split()
print(df[df['age']>=21])

# =================================================
# 문제 3. gender가 "여"인 학생만 출력하세요.
# =================================================
split()
print(df.query("gender == '여'"))

# =================================================
# 문제 4. major가 "데이터분석"인 학생만 출력하세요.
# =================================================
split()
print(df.query("major == '데이터분석'"))

# =================================================
# 문제 5. score가 80점 이상이고 gender가 "여"인 학생만 출력하세요.
# =================================================
split()
print(df.query("score >= 80 and gender == '여'"))

# =================================================
# 문제 6. age가 21세 이상이고 score가 90점 이상인 학생의 name, age, score 
#           컬럼만 출력하세요.
# =================================================
split()
print(df.query("age >= 21 and score >= 90")[['name', 'age', 'score']])

# =================================================
# 문제 7. isin()을 사용하여 major가 "데이터분석" 또는 "인공지능"인 학생만 
#           출력하세요.
# =================================================
split()
print(df[df['major'].isin(['데이터분석', '인공지능'])])

# =================================================
# 문제 8. isin()을 사용하여 name이 "김민수", "최유진", "정다은" 중 하나인 
#           학생만 출력하세요.
# =================================================
split()
print(df[df['name'].isin(["김민수", "최유진", "정다은"])])

# =================================================
# 문제 9. query()를 사용하여 score가 90점 이상인 학생만 출력하세요.
# =================================================
split()
print(df.query("score >= 90"))
              
# =================================================
# 문제 10. query()를 사용하여 age가 21세 이상이고 score가 85점 이상인 
#             학생만 출력하세요.
# =================================================
split()
print(df.query("age >= 21 and score >= 85"))

# #########################################################
# #				자료형 변환 문제 10개                                       #
# #########################################################
# =================================================
# 문제 11. 각 컬럼의 자료형을 확인하세요.
# =================================================
split()
print(df.dtypes)

# =================================================
# 문제 12. id 컬럼의 자료형을 문자열형(str)으로 변환한 후 자료형을 확인하세요.
# =================================================
split()
df['id'] = df['id'].astype(str)
print(df.dtypes)

# =================================================
# 문제 13.  age 컬럼의 자료형을 int8로 변환한 후 자료형을 확인하세요.
# =================================================
split()
df['age'] = df['age'].astype('int8')
print(df.dtypes)

# =================================================
# 문제 14. score 컬럼의 자료형을 float으로 변환한 후 자료형을 확인하세요.
# =================================================
split()
df['age'] = df['age'].astype(float)
print(df.dtypes)

# =================================================
# 문제 15.  score 컬럼을 astype(str)을 사용하여 문자열형으로 변환하세요.
#              그 후 자료형을 확인하세요.
# =================================================
split()
df['score'] = df['score'].astype(str)
print(df.dtypes)

# =================================================
# 문제 16.  문자열형으로 변환된 score 컬럼을 pd.to_numeric()을 사용하여 
#               다시 숫자형으로 변환하세요.
#               그 후 자료형을 확인하세요.
# =================================================
split()
df['score'] = pd.to_numeric(df['score'], downcast='integer')
print(df.dtypes)

# =================================================
# 문제 17. age 컬럼을 문자열형으로 변환한 후, pd.to_numeric()을 사용하여 
#             다시 숫자형으로 변환하세요.
# =================================================
split()
df['age'] = df['age'].astype(str)
print(df.dtypes)
df['age'] = pd.to_numeric(df['age'], downcast='integer')
print(df.dtypes)

# =================================================
# 문제 18. 다음 코드를 실행하여 score 컬럼에 잘못된 문자열 값을 추가하세요.
#              df.loc[5] = [6, "테스트", "남", 24, "컴퓨터공학", "점수없음", "2026-03-10"]
#              그 후 pd.to_numeric()의 errors="coerce"를 사용하여 숫자로 변환할 
#              수 없는 값을 NaN으로 처리하세요.
# =================================================
split()
df.loc[5] = [6, "테스트", "남", 24, "컴퓨터공학", "점수없음", "2026-03-10"]
print(df, '\n')
df['score'] = pd.to_numeric(df['score'], errors='coerce')
print(df)

# =================================================
# 문제 19.  join_date 컬럼을 pd.to_datetime()을 사용하여 날짜형으로 변환하세요.
#            그 후 자료형을 확인하세요.
# =================================================
split()
df['join_date'] = pd.to_datetime(df['join_date'])
print(df)

# =================================================
# 문제 20. join_date 컬럼을 날짜형으로 변환한 후, 가입일이 2026-03-05 이후인 
#            학생만 출력하세요.
# =================================================
split()
print(df[df['join_date'] >= '2026-03-05'])