# ================================================================
# 사용자 정의 함수 실습
# ================================================================
# [1] 사용자 지정한 범위의 숫자들 중에서 짝수인 숫자만
#     합계를 해서 반환해주는 함수
# 예시 : 5, 100 => 범위에서 2의 배수만 합계 계산
# ================================================================
def sum_even(num_list):
    return sum([num for num in range(num_list[0], num_list[1]+1) if not num%2])

print(sum_even(list(map(int, input().split()))))

# ================================================================
# [2] 전달받은 단어에 대한 기계 코드값 출력해주는 함수
# 예시 : 'Hello' => 모니터에 'Hello' 기계코드 : 11-----00011
# ================================================================
def binary(word):
    print(f'{word} : {"".join([bin(ord(s)) for s in word]).replace("0b","")}')

print(binary(input()))
