## =================================================
##        키워드 파라미터 가변인자 매개변수 함수
##--------------------------------------------------
## =================================================
## 함수기능 : 학생의 학점을 출력해주는 기능
##           학생마다 과목의 개수와 과목이 다름
## 함수이름 : get_grade
## 매개변수 : **score
## 함수결과 : grade
## =================================================
def get_grade(**scores):
    grade = 0
    for score in scores.values():
        grade += score
    grade /= len(scores) if len(scores) else 1

    # print("키워드파라미터 :", type(score))

    return grade

## =================================================
## 함수기능 : 0개 ~ n개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addInt
## 매개변수 : 고정 X, *nums
## 함수결과 : total
## =================================================
def addInt(*nums):
    # print(f"가변인자 매개변수 타입 : {type(nums)}")
    return sum(nums)

# --------------------------------------------------
# 함수 사용 즉, 함수 호출
# => 함수 호출 시 전달되는 argument/인수 : *변수명 => 언패킹해서 전달
# --------------------------------------------------
data = 11, 22, 33, 44, 55
print(f"addInt(11, 22, 33, 44, 55) : {addInt(11, 22, 33, 44, 55)}")
print(f"addInt(*data)               : {addInt(*data)}")

score = {'sci':100, 'kor':80, 'eng':75}

print(f"get_grade(sci=100, kor=80, eng=75) : {get_grade(sci=100, kor=80, eng=75)}")
print(f"get_grade(**score)                 : {get_grade(**score)}")