# ==============================================
# 컨테이너 자료형 - [4] Dict 타입
# 
# - Dict와 내장함수 : len(), max(), min(), sum(), sorted()
# ==============================================
# dict 데이터 생성
# -------------------------------
# [예시] 6개 과목별 점수를 저장
#       국어 99, 미술 80, 음악 100, 물리 90, 영어 72, 수학 81
score1 = {'국어':99, '미술':80, '음악':100, '물리':90, '영어':72, '수학':81}

print(f"타입 : {type(score1)}, 원소 개수 : {len(score1)}개, 데이터 : {score1}")

# ========================================================
# 내장함수 max()와 min() : ★ 키만 비교함, 값은 고려대상 아님
# ========================================================
mx, mn = max(score1), min(score1)

print(f"최대값 : {mx}, 최소값 : {mn}")

# ========================================================
# 내장함수 sorted() : ★ 키만 정렬함, 값은 고려대상 아님
# ========================================================
ret = sorted(score1)
print(f"정렬 결과 : {ret}, {type(ret)}")

