# ==============================================
# 컨테이너 자료형 - [4] Dict 타입
# 
# - Dict와 연산자
# ==============================================
# dict 데이터 생성
# -------------------------------
# [예시] 6개 과목별 점수를 저장
#       국어 99, 미술 80, 음악 100, 물리 90, 영어 72, 수학 81
score1 = {'국어':99, '미술':80, '음악':100, '물리':90, '영어':72, '수학':81}
score2 = {'국어':100, '체육':70, '경제':100}

print(f"타입 : {type(score1)}, 원소 개수 : {len(score1)}개, 데이터 : {score1}")
print(f"타입 : {type(score2)}, 원소 개수 : {len(score2)}개, 데이터 : {score2}")

# ========================================================
# 연산자 (1) 덧셈 : dict + dict => 미지원 기능
# ========================================================
# newDict = score1 + score2   # Error 발생

# ========================================================
# 연산자 (2) 곱셈 : dict * int => 미지원 기능
# ========================================================
# newDict = score1 * 2        # Error 발생

# ========================================================
# 연산자 (3) 멤버 연산자 : in / not in
#                            ★ 단 Key만 가능
# ========================================================
# 키 존재 여부 체크
print(f"'경제' in score2 : {'경제' in score2}")
print(f"'경제' in score1 : {'경제' in score1}")

# 값 존재 여부 체크 => ★ 키만 존재 여부 확인함
print(f"99 in score2 : {99 in score2}")
print(f"99 in score1 : {99 in score1}")